┌────────────────────────────────────────────────────────────────────────┐
│                            КОМАНДЫ  СИСТЕМЫ                            │
├────────────────────────────────────────────────────────────────────────┤
│    R[Addr] - прочитать микрокоманду.                                   │
│    W       - записать микрокоманду.                                    │
│    <(>)    - открыть предыдущую (следующую) ячейку.                    │
│    Z       - очистить часть ПЗУ.                                       │
│    M[Fild] - модифицировать поле микрокоманды.                         │
│    L[T]    - вывести листинг микропрограммы на экран.                  │
│    L[P]    - вывести листинг микропрограммы на принтер.                │
│    L[F]    - вывести листинг микропрограммы в файл                     │
│    В       - установить начальные параметры модели.                    │
│    G       - начать моделирование.                                     │
│    P       - продолжить моделирование.                                 │
│    S       - установить начальные значения регистров.                  │
│    D       - вывести значения отдельных регистров модели.              │
│    I       - вывести значения всех регистров модели.                   │
│    E       - конец работы.                                             │
│    H       - обратиться к справочнику системы.                         │
│    F[L]    - чтение из файла.                                          │
│    F[S]    - сохранение части ПЗУ в файле.                             │
│    C       - смена имени задачи.                                       │
└────────────────────────────────────────────────────────────────────────┘
$
┌────────────────────────────────────────────────────────────────────────┐
│                          ФОРМАТ  МИКРОКОМАНДЫ                          │
├────────┬───────────┬───────────────────────────────────────────────────┤
│  Поле  │  Разряды  │ Значение                                          │
├────────┼───────────┼───────────────────────────────────────────────────┤
│   М1   │  63 - 48  │ Поле констант.                                    │
│   M2   │  47 - 46  │ Управление маской и инверсией условия.            │
│   M3   │  45 - 42  │ Управление мультиплексором условий.               │
│   M4   │  41 - 38  │ Управление БМУ.                                   │
│   M5   │  37 - 33  │ Управление мультиплексором адреса A.              │
│   M6   │  32 - 28  │ Управление мультиплексором адреса B.              │
│   M7   │  27 - 26  │ Управление сдвигами.                              │
│   M8   │  25 - 24  │ Управление входом переноса.                       │
│   M9   │  23 - 21  │ Управление источниками операндов АЛУ.             │
│   M10  │  20 - 18  │ Управление операцией АЛУ.                         │
│   M11  │  17 - 15  │ Управление приемником результата АЛУ.             │
│   M12  │  14 - 12  │ Управление входной шиной D.                       │
│   M13  │  11 - 10  │ Управление регистром состояния.                   │
│   M14  │   9 -  8  │ Управление выходной шиной Y.                      │
│   M15  │   7 -  0  │ Управление вводом-выводом.                        │
└────────┴───────────┴───────────────────────────────────────────────────┘
$
┌────────────────────────────────────────────────────────────────────────┐
│                  М1     63 - 48    Поле констант.                      │
└────────────────────────────────────────────────────────────────────────┘
┌────────────────────────────────────────────────────────────────────────┐
│      M2     47 - 46    Управление маской и инверсией условия.          │
├────────────────────────────────────────────────────────────────────────┤
│                          ВАРИАНТ 1XX                                   │
├────────────────────────────────────────────────────────────────────────┤
│              M2 = 0,2 -- нет инверсии условия.                         │
│              M2 = 1,3 -- инверсия условия.                             │
│              Маскирование выполняется командами JMAP и CJV.            │
├────────────────────────────────────────────────────────────────────────┤
│                          ВАРИАНТ 0XX                                   │
├────────────────────────────────────────────────────────────────────────┤
│              0 -- нет инверсии условия и нет маски.                    │
│              1 -- инверсия условия , маски нет.                        │
│              2 -- нет инверсии условия , маскирование адреса.          │
│              3 -- инверсия условия , маскирование адреса.              │
└────────────────────────────────────────────────────────────────────────┘
$
┌────────────────────────────────────────────────────────────────────────┐
│  M3     45 - 42    Управление мультиплексором условий.                 │
├───────────────────┬────────────────────────────────────────────────────┤
│                   │                  Для M3=10..17                     │
│                   ├────────────────────────────────┬───────────────────┤
│    Для M3=0..7    │           Вариант 1XX          │    Вариант 0XX    │
│                   ├───────────────┬────────────────┼───────────────────┤
│                   │    M2=0,1     │     M2=2,3     │      M2=0..3      │
├───────────────────┼───────────────┼────────────────┼───────────────────┤
│  0 -- PSW[0]      │ 10 -- FLG[0]  │ 10 -- УР1      │  10 -- FLG[0]     │
│  1 -- PSW[1]      │ 11 -- FLG[1]  │ 11 -- УР2.1    │  11 -- FLG[1]     │
│  2 -- PSW[2]      │ 12 -- FLG[2]  │ 12 -- УР2.2    │  12 -- FLG[2]     │
│  3 -- PSW[3]      │ 13 -- FLG[3]  │ 13 -- УР3      │  13 -- FLG[3]     │
│  4 -- PSW[4]      │ 14 -- FLG[4]  │ 14 -- УР4      │  14 -- FLG[4]     │
│  5 -- PSW[5]      │ 15 -- FLG[5]  │ 15 -- УР5      │  15 -- FLG[5]     │
│  6 -- ПЕРЕНОС СТ  │ 16 -- FLG[6]  │ 16 -- RK[11/9] │  16 -- FLG[6]     │
│  7 -- КОНСТАНТА 0 │ 17 -- FLG[7]  │ 17 -- RK[5/3]  │  17 -- FLG[7]     │
└───────────────────┴───────────────┴────────────────┴───────────────────┘
$
┌────────────────────────────────────────────────────────────────────────┐
│  M4     41 - 38    Управление БМУ.                                     │
├────────────────────────────────────────────────────────────────────────┤
│  0 -- перейти на нулевой адрес (JZ).                                   │
│  1 -- условный переход к подпрограмме по адресу из RMK (CJS).          │
│  2 -- переход по адресу из старшего байта RK (JMAP).                   │
│  3 -- условный переход по адресу из RMK (CJP).                         │
│  4 -- загрузка стека и условная загрузка счетчика СТ (PUSH).           │
│  5 -- условный переход к подпрограмме по адресу из RA ,                │
│       либо из RMK (JSRP).                                              │
│  6 -- условный переход по адресу из младшего байта RK (CJV).        │
│  7 -- условный переход на адрес из RA , либо из RMK (JRP).             │
│ 10 -- повторение цикла , если счетчик не равен нулю (RFCT).            │
│ 11 -- повторение по адресу , выбираемому из RMK , если                 │
│       счетчик не равен нулю (RPCT).                                    │
│ 12 -- условный возврат из подпрограммы (CRTN).                         │
│ 13 -- условный переход по адресу из RMK  и прием из стека (CJPP).      │
│ 14 -- загрузка счетчика и последовательная выборка (LDCT).             │
│ 15 -- проверка условия окончания цикла (LOOP).                         │
│ 16 -- последовательная выборка (CONT).                                 │
│ 17 -- переход по адресу выбираемому из RMK (JP).                       │
└────────────────────────────────────────────────────────────────────────┘
$
┌────────────────────────────────────────────────────────────────────────┐
│  M5     37 - 33    Управление мультиплексором адреса A.                │
├────────────────────────────────────────────────────────────────────────┤
│  Для M5=(0-17)  A=M5;                                                  │
│  Для M5=(20-27) A=RK[2/0];                                             │
│  Для M5=(30-37) A=RK[8/6].                                             │
└────────────────────────────────────────────────────────────────────────┘
┌────────────────────────────────────────────────────────────────────────┐
│  M6     32 - 28    Управление мультиплексором адреса B.                │
├────────────────────────────────────────────────────────────────────────┤
│  Для M6=(0-17)  B=M6;                                                  │
│  Для M6=(20-27) B=RK[2/0];                                             │
│  Для M6=(30-37) B=RK[8/6].                                             │
└────────────────────────────────────────────────────────────────────────┘
$
┌────────────────────────────────────────────────────────────────────────┐
│  M7     27 - 26    Управление сдвигами.                                │
├───────────────┬────────────────────────────────────────────────────────┤
│     Код       │                                                        │
├────────┬──────┤                   Схема сдвига                         │
│  M11[1]│  M7  │                                                        │
├────────┼──────┼────────────────────────────────────────────────────────┤
│     0  │ 0    │  "0"──>[R]──>[PSW(0)]        "0"──>[RQ]──>             │
│        │      │                                                        │
│     0  │ 1    │  ┌─>[R]──>[PSW(0)]──>┐        ┌─>[RQ]──>┐              │
│        │      │  └───────────────────┘        └─────────┘              │
│     0  │ 2    │  [PSW(0)]──>[R]─────────────>[RQ]──>[PSW(0)]           │
│        │      │                                                        │
│     0  │ 3    │  [(F15[+]OVR)]──>[R]────────>[RQ]──>[PSW(0)]           │
│        │      │                                                        │
│     1  │ 0    │  [PSW(0)]<──[R]<──"0"        <──[RQ]<──"0"             │
│        │      │                                                        │
│     1  │ 1    │  ┌<──[PSW(0)]<──[R]<──┐       ┌<──[RQ]<─┐              │
│        │      │  └────────────────────┘       └─────────┘              │
│     1  │ 2    │  [PSW(0)]<──[R]<───────────────[RQ]<──"1"              │
│        │      │                                                        │
│     1  │ 3    │  [PSW(0)]<──[R]<───────────────[RQ]<──"0"              │
└────────┴──────┴────────────────────────────────────────────────────────┘
$
┌─────────────────────────────┬──────────────────────────────────────────┐
│        M8     25 - 24       │             M9     23 - 21               │
├─────────────────────────────┼──────────────────────────────────────────┤
│ Управление входом переноса. │ Управление источниками операндов АЛУ.    │
├─────┬───────────────────────┼─────┬─────────────┬───────┬──────────────┤
│ Код │ Значение вх.переноса  │ Код │    R :: S   │   Код │    R :: S    │
├─────┼───────────────────────┼─────┼─────────────┼───────┼──────────────┤
│  0  │  "0"                  │  0  │    A :: Q   │    4  │    0 :: A    │
│  1  │  "1"                  │  1  │    A :: B   │    5  │    D :: A    │
│  2  │  PSW[0]               │  2  │    0 :: Q   │    6  │    D :: Q    │
│  3  │  NOT PSW[0]           │  3  │    0 :: B   │    7  │    D :: 0    │
└─────┴───────────────────────┴─────┴─────────────┴───────┴──────────────┘
┌────────────────────────────────────────────────────────────────────────┐
│  M10    20 - 18    Управление операцией АЛУ.                           │
├────────────────────────────────────────────────────────────────────────┤
│  Код     Операция          Код     Операция                            │
├────────────────────────────────────────────────────────────────────────┤
│  0  --   R+S+C0            4  --   R & S                               │
│  1  --   S-R-1+C0          5  --   NOT(R) & S                          │
│  2  --   R-S-1+C0          6  --   R [+] S                             │
│  3  --   R V S             7  --   NOT(R [+] S)                        │
└────────────────────────────────────────────────────────────────────────┘
$
┌────────────────────────────────────────────────────────────────────────┐
│  M11    17 - 15    Управление приемником результата АЛУ.               │
├───────┬───────────┬─────────────┬──────────┬────────────┬──────────────┤
│  Код  │ Сдвиг РЗУ │Загрузка РЗУ │ Сдвиг RQ │Загрузка RQ │Выход "Y"     │
├───────┼───────────┼─────────────┼──────────┼────────────┼──────────────┤
│  0    │    ---    │   ---       │   ---    │   F-->Q    │    F         │
│  1    │    ---    │   ---       │   ---    │    ---     │    F         │
│  2    │    ---    │  F-->B      │   ---    │    ---     │    A         │
│  3    │    ---    │  F-->B      │   ---    │    ---     │    F         │
│  4    │    -->    │  F/2-->B    │   -->    │  Q/2-->Q   │    F         │
│  5    │    -->    │  F/2-->B    │   ---    │    ---     │    F         │
│  6    │    <--    │  2*F-->B    │   <--    │  2*Q-->Q   │    F         │
│  7    │    <--    │  2*F-->B    │   ---    │    ---     │    F         │
└───────┴───────────┴─────────────┴──────────┴────────────┴──────────────┘
┌────────────────────────────────────────────────────────────────────────┐
│  M12    14 - 12    Управление входной шиной D.                         │
├────────────────┬───────────────────────────────────────────────────────┤
│  0 -- RDI-->D  │   4 -- RDI-->D ; BI-->RDI                             │
│  1 -- ZI-->D   │   5 -- ZI-->D  ; BI-->RDI                             │
│  2 -- M1-->D   │   6 -- M1-->D  ; BI-->RDI                             │
│  3 -- PSW-->D  │   7 -- RDI-->D ; BI-->RDI ; BI-->RK                   │
└────────────────┴───────────────────────────────────────────────────────┘
$
┌────────────────────────────────────────────────────────────────────────┐
│  M13    11 - 10    Управление регистром состояния.                     │
├────────────────────────────────────────────────────────────────────────┤
│  0 -- сохранение PSW                                                   │
│  1 -- загрузка по признакам МПС К1804ВС1                               │
│  2 -- загрузка с учетом сдвигов                                        │
│  3 -- загрузка с шины "Y"                                              │
├───┬─────────────────────────────┬─────────────────────────────┬────────┤
│PSW│            M13=1            │            M13=2            │ M13=3  │
├───┼─────────────────────────────┼─────────────────────────────┼────────┤
│ 0 │ C16-перенос в старший разряд│ Выталкиваемый разряд        │  Y[0]  │
│ 1 │ OVR-сигнал переполнения     │ OVR-сигнал переполнения     │  Y[1]  │
│ 2 │ Z-сигнал нулевого результата│ Z-сигнал нулевого результата│  Y[2]  │
│ 3 │ F15-знак результата         │ F15 [+] OVR                 │  Y[3]  │
│ 4 │     ---                     │     ---                     │  Y[4]  │
│ 5 │     ---                     │     ---                     │  Y[5]  │
│ 6 │     ---                     │     ---                     │  Y[6]  │
│ 7 │     ---                     │     ---                     │  Y[7]  │
└───┴─────────────────────────────┴─────────────────────────────┴────────┘
$
┌────────────────────────────────────────────────────────────────────────┐
│  M14     9 -  8    Управление выходной шиной Y.                        │
├────────────────────────────────────────────────────────────────────────┤
│  0 --    ---                                                           │
│  1 --  Y --> RDO                                                       │
│  2 --  Y --> MAR                                                       │
│  3 --    ---                                                           │
└────────────────────────────────────────────────────────────────────────┘
┌────────────────────────────────────────────────────────────────────────┐
│  M15     7 -  0    Управление вводом-выводом.                          │
├────────────────────────────────────────────────────────────────────────┤
│                    Поле кодировки пользователя.                        │
└────────────────────────────────────────────────────────────────────────┘